---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.MaxHookExtensionMultiplierWarn
source: html/54043a24-0ed7-f3af-9703-769628af8228.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.MaxHookExtensionMultiplierWarn Property

The allowable range of values for the Rebar Hook Extension Multiplier is from 0.01 to 99.0.

## Syntax (C#)
```csharp
public static FailureDefinitionId MaxHookExtensionMultiplierWarn { get; }
```